Tekla Open API Reference for Tekla Structures 2025
Point.AreEqual Method
 Compares two points and tells whether they are equal.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool AreEqual(
	Point Point1,
	Point Point2
)
Public Shared Function AreEqual (
	Point1 As Point,
	Point2 As Point
) As Boolean
Parameters
Point1
Type: Tekla.Structures.Geometry3d.Point
The first point to be compared.
Point2
Type: Tekla.Structures.Geometry3d.Point
The second point to be compared.
Return Value
Type: Boolean
True if the points are equal, false otherwise.
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace